liveFunding/app/controllers/transactions_controller.rb

  def index
    @transactions = Transaction.all
---
SELECT * FROM "transactions"

  def create
    @transaction = Transaction.new(params[:transaction])

    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("created_at", "updated_at", "from", "amount", "to", "rank", "description") VALUES('2010-02-05 00:34:23', '2010-02-05 00:34:23', 'liang', 100.0, 'wang', NULL, 'first')

  def edit
    @transaction = Transaction.find(params[:id])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 2)

  def update
    @transaction = Transaction.find(params[:id])

    respond_to do |format|
      if @transaction.update_attributes(params[:transaction])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 2)
UPDATE "transactions" SET "updated_at" = '2010-02-05 00:36:23', "amount" = 205.0 WHERE "id" = 2

  def show
    @transaction = Transaction.find(params[:id])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 1)