liveFunding/app/controllers/users_controller.rb

INSERT INTO "users" ("updated_at", "hashed_password", "username", "phone_number", "firstname", "lastname", "email", "created_at") VALUES('2010-02-03 23:58:56', 'bdb504f2d9c4214b9586c74ea5fa5a1dd3550da6', 'Joonas', NULL, 'Joonas', 'Sirén', NULL, '2010-02-03 23:58:56')
---
  def create
    @user = User.new(params[:user])
    if @user.save